In [2]:
import numpy as np
import pandas as pd
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [6]:
pd.Series(data=my_data,index=labels) #index change to labels value

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [12]:
[sum,print,len]

[<function sum(iterable, /, start=0)>,
 <function print(*args, sep=' ', end='\n', file=None, flush=False)>,
 <function len(obj, /)>]

In [14]:
ser1=pd.Series([1,2,3,4,5],['USA','Germany','USSR','India','Japan'])
ser2=pd.Series([1,2,6,4],['USA','Italy','Germany','India'])
ser1['India']

4

In [16]:
ser1+ser2

Germany    8.0
India      8.0
Italy      NaN
Japan      NaN
USA        2.0
USSR       NaN
dtype: float64

In [22]:
np.random.randn(5,4)

array([[-0.45802699,  0.43516349, -0.58359505,  0.81684707],
       [ 0.67272081, -0.10441114, -0.53128038,  1.02973269],
       [-0.43813562, -1.11831825,  1.61898166,  1.54160517],
       [-0.25187914, -0.84243574,  0.18451869,  0.9370822 ],
       [ 0.73100034,  1.36155613, -0.32623806,  0.05567601]])

In [24]:
np.random.seed(100)
df=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])#data here 2d 0 uniform disutribution of 5 row, 4 colmn, 2nd arg is index,3rd colmns
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [28]:
print(df['W']) #kind of series
print(df['W']['A'])
print(df[['W','Z']])

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
E   -0.531280
Name: W, dtype: float64
-1.7497654730546974
          W         Z
A -1.749765 -0.252436
B  0.981321 -1.070043
C -0.189496  0.435163
D -0.583595 -0.104411
E -0.531280 -1.118318

In [30]:
df['new']=df['W']+df['Y']
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436 -0.596730
B  0.981321  0.514219  0.221180 -1.070043  1.202500
C -0.189496  0.255001 -0.458027  0.435163 -0.647523
D -0.583595  0.816847  0.672721 -0.104411  0.089126
E -0.531280  1.029733 -0.438136 -1.118318 -0.969416

In [38]:
df.drop('new',axis=1,inplace=True) #axis=1 means column, 0 mean row, effect the df variable , remove from their too

In [40]:
#data frames similiar to numpy array 
df.shape #row is 0, colmn is 1 that why axis=0 is row

(5, 4)

In [42]:
df.loc['A'] #return colmns series

W   -1.749765
X    0.342680
Y    1.153036
Z   -0.252436
Name: A, dtype: float64

In [44]:
df.iloc[1] #index based location

W    0.981321
X    0.514219
Y    0.221180
Z   -1.070043
Name: B, dtype: float64

In [46]:
df.loc[['A','B'],['W','X']]

          W         X
A -1.749765  0.342680
B  0.981321  0.514219

In [48]:
df>0

       W     X      Y      Z
A  False  True   True  False
B   True  True   True  False
C  False  True  False   True
D  False  True   True  False
E  False  True  False  False

In [50]:
df[df>0] #NaN is null

          W         X         Y         Z
A       NaN  0.342680  1.153036       NaN
B  0.981321  0.514219  0.221180       NaN
C       NaN  0.255001       NaN  0.435163
D       NaN  0.816847  0.672721       NaN
E       NaN  1.029733       NaN       NaN

In [52]:
df['W']>0

A    False
B     True
C    False
D    False
E    False
Name: W, dtype: bool

In [68]:
df[(df['Y']>0) & (df['X']>0)][['Y','X']] #and doesnt' work becuase df['W']>0 work on series of value not on single value

          Y         X
A  1.153036  0.342680
B  0.221180  0.514219
D  0.672721  0.816847

In [70]:
df[(df['Y']>0) | (df['X']>0)]

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [90]:
df.reset_index(inplace=True) #youg get extra colmn , old index become column in data frame

In [106]:
df['index']

0    A
1    B
2    C
3    D
4    E
Name: index, dtype: object

In [112]:
new_index=['CA','DF','NY','WY','OR']
df['states']=new_index

In [116]:
df.set_index('states',inplace=True)

In [118]:
df

       index         W         X         Y         Z
states
CA         A -1.749765  0.342680  1.153036 -0.252436
DF         B  0.981321  0.514219  0.221180 -1.070043
NY         C -0.189496  0.255001 -0.458027  0.435163
WY         D -0.583595  0.816847  0.672721 -0.104411
OR         E -0.531280  1.029733 -0.438136 -1.118318

In [130]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index2=pd.MultiIndex.from_tuples(hier_index)
hier_index2

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [124]:
hier_index2

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [138]:
df1=pd.DataFrame(np.random.randn(6,2),hier_index2,['A','B'])#6*2 2d array, index is multi index, colmn is A,B

In [140]:
df1

             A         B
G1 1 -0.756352  0.816454
   2  0.750445 -0.455947
   3  1.189622 -1.690617
G2 1 -1.356399 -1.232435
   2 -0.544439 -0.668172
   3  0.007315 -0.612939

In [155]:
df1.loc['G1'].loc[1]

A   -0.756352
B    0.816454
Name: 1, dtype: float64

In [157]:
df1.index.names=['Groups','Num']

In [159]:
df1

                   A         B
Groups Num
G1     1   -0.756352  0.816454
       2    0.750445 -0.455947
       3    1.189622 -1.690617
G2     1   -1.356399 -1.232435
       2   -0.544439 -0.668172
       3    0.007315 -0.612939

In [161]:
df1.xs('G1') #cross section

            A         B
Num
1   -0.756352  0.816454
2    0.750445 -0.455947
3    1.189622 -1.690617

In [163]:
df1.xs(1,level='Num') # get 1 row of all groups , level is name of column

               A         B
Groups
G1     -0.756352  0.816454
G2     -1.356399 -1.232435

In [167]:
df2={'a':[1,2,np.nan],'b':[4,np.nan,np.nan],'c':[1,2,3]}
dfmissing=pd.DataFrame(df2)
dfmissing

     a    b  c
0  1.0  4.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [177]:
dfmissing.dropna(axis=1,thresh=2) #remove row that has at least 1 null value, axis=1 means on column, thres =2, remove if at least 2 null value
dfmissing.dropna(axis=0,thresh=2)

     a    b  c
0  1.0  4.0  1
1  2.0  NaN  2

In [179]:
dfmissing.fillna(value='FILL') #fill null/missing value

      a     b  c
0   1.0   4.0  1
1   2.0  FILL  2
2  FILL  FILL  3

In [183]:
dfmissing['a'].fillna(value=dfmissing['a'].mean()) #fill nul value with mean value

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [249]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data, columns=['Company', 'Person', 'Sales'])

In [251]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [265]:
by_comp = df.groupby("Company")
print(by_comp)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x177b08290>

In [281]:
print(by_comp.mean(numeric_only=True))
by_comp.std(numeric_only=True).loc['FB']

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

Sales    75.660426
Name: FB, dtype: float64

In [283]:
 df.groupby("Company").max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [291]:
 df.groupby("Company").describe().transpose() #transpose convert row to colmn

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [239]:
df

   A1   B1  C1
0   1  NaN   1
1   1  2.0   2
2   2  3.0   1
3   1  4.0   1
4   2  5.0   2

In [293]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [297]:
pd.concat([df1,df2],axis=1) #column

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [299]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})  
pd.merge(left,right,how='inner',on='key') #https://github.com/danielmercy/Python_for_Data_Science_and_Machine_Learning-Bootcamp/blob/master/03-Python-for-Data-Analysis-Pandas/06-Merging%2C%20Joining%2C%20and%20Concatenating.ipynb

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [303]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])
left.join(right) #k3 missing becuase not present in left, K1 not present in right no NaN
#how='outer' means all present

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [309]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [313]:
df['col2'].unique() #return unique value

array([444, 555, 666])

In [315]:
df['col2'].nunique() #return count of unique value

3

In [317]:
df['col2'].value_counts() # no use how many time

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [321]:
def times2(x):
    return x*2
df['col1'].sum()
df['col1'].apply(times2) #this will apply times2 on col1 data

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [323]:
df['col3'].apply(len) #give length of str

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [325]:
df['col1'].apply(lambda x: x*3) #returning 3 times of data using lambda

0     3
1     6
2     9
3    12
Name: col1, dtype: int64

In [331]:
df.drop('col1',axis=1) #1 for column

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [335]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [337]:
df.sort_values(by='col2') #sort value by column, index attached to row

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [339]:
df.isnull() #return null value

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [341]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [343]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [345]:
df.pivot_table(values='D',index=['A','B'],columns=['C']) #create multi index from this table , index 'A','B' will become multi level index
#no value at bar,two,x so null value

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [347]:
ls

Excel_Sample.xlsx  pandas.ipynb

In [349]:
pd.read_csv('example.csv')

,id,first_name,last_name,email,gender,ip_address,city
0,1,Joseph,Zaniolini,jzaniolini0@simplemachines.org,Male,163.168.68.132,Pedro Leopoldo
1,2,Freida,Drillingcourt,fdrillingcourt1@umich.edu,Female,97.212.102.79,Buri
2,3,Nanni,Herity,nherity2@statcounter.com,Female,145.151.178.98,Claver
3,4,Orazio,Frayling,ofrayling3@economist.com,Male,25.199.143.143,Kungur
4,5,Julianne,Murrison,jmurrison4@cbslocal.com,Female,10.186.243.144,Sainte-Luce-sur-Loire
...,...,...,...,...,...,...,...
995,996,Parrnell,Jeff,pjeffrn@4shared.com,Male,159.55.55.39,Dengok
996,997,Pat,Warstall,pwarstallro@dropbox.com,Male,169.200.7.131,Rosário do Sul
997,998,Willyt,Vannuccini,wvannuccinirp@tuttocitta.it,Female,156.149.18.155,Xiaopingba
998,999,Gaelan,Petrashkov,gpetrashkovrq@hostgator.com,Male,219.109.169.75,Bethlehem
999,1000,Stirling,Francesc,sfrancescrr@cyberchimps.com,Male,108.193.9.206,Potok Złoty

In [353]:
df.to_csv('my-new.csv',index=False) #writing to csv, don't want to save indexes

In [357]:
#in excel it can only import data, can't formula , images, macros, can crash if asking
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [359]:
data=pd.read_html('https://www.fdic.gov/bank-failures/failed-bank-list') #panda find every table in html table
#and convert it into list of dataframe

In [375]:
data[0].head()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544

In [377]:
from sqlalchemy import create_engine #allow to create a sql engine in memory
engine=create_engine('sqlite:///:memory:')

In [379]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [381]:
df.to_sql('new_table',engine) #2nd arg is connection

6

In [383]:
sqldf=pd.read_sql('new_table',engine)
sqldf

   index    A    B  C  D
0      0  foo  one  x  1
1      1  foo  one  y  3
2      2  foo  two  x  2
3      3  bar  two  y  5
4      4  bar  one  x  4
5      5  bar  one  y  1